artilleryTestGet.yaml
config:
  target: http://localhost:3002
  ensure:
    p95: 1000
  phases:
  - duration: 100
    arrivalRate: 1
    name: Warm up phase
  - duration : 300
    arrivalRate: 3
    rampTo: 30
    maxVusers: 30
    name: 12 users per second
  - duration : 300
    arrivalRate: 30
    maxVusers: 30
    name: 100 users per second
  payload:
      path: "gameIds.csv"
      fields:
        - "gameId"
scenarios:
  - flow:
      - get:
          url: "/api/reviewcount/detail/{{gameId}}"
      - get:
          url: "/api/reviewcount/recent/detail/{{gameId}}"
      - get:
          url: "/api/reviewcount/{{gameId}}"
      - get:
          url: "/api/reviewcount/recent/{{gameId}}"